Repository: pypi-data/pypi-mirror-338
Catalog: packages/senaite.panic/senaite.panic-2.1.0.zip/senaite.panic-2.1.0/src/senaite/panic/locales/*/LC_MESSAGES/senaite.panic.po
Languages: cs

source: '{}' value must be above '{}' or empty
cs: Hodnota '{}' musí být nad '{}' nebo prázdná

source: '{}' value must be below '{}' or empty
cs: Hodnota '{}' musí být pod '{}' nebo prázdná

source: '{}' value must be numeric or empty
cs: Hodnota „{}“ musí být číselná nebo prázdná

source: Alert client
cs: Upozornit klienta

source: Alert client about panic levels exceeded
cs: Upozornění klienta o překročení úrovní paniky

source: An email alert has been sent already.
cs: E-mailové upozornění již bylo odesláno.

source: Body
cs: Tělo

source: Email alert body template
cs: Šablona těla e-mailu s upozorněním

source: Email alert subject
cs: Předmět e-mailu s upozorněním

source: Max
cs: Maximální

source: Max panic
cs: Maximání panika

source: Min
cs: Minimální

source: Min panic
cs: Minimální panika

source: Panic < Min
cs: Panika < Minimální

source: Panic > Max
cs: Panika > Maximální

source: Panic Settings
cs: Nastavení paniky

source: Panic level alerts for SENAITE
cs: Úrovně výstrah paniky pro SENAITE

source: Panic notification email sent
cs: E-mail s oznámením paniky odeslán

source: Panic result
cs: Výsledek paniky

source: SENAITE PANIC (uninstall)
cs: SENAITE PANIC (odinstalovat)

source: SENAITE PANIC Settings
cs: SENAITE PANIC Nastavení

source: Some results exceeded the panic levels
cs: Některé výsledky překročily úrovně paniky

source: Some results from Sample ${sample_id} exceeded panic range
cs: Některé výsledky ze vzorku ${sample_id} překročily rozsah paniky

source: Some values exceeded the panic levels. Send an email to the clinic or close this window if you want to re-test to confirm the panic value.
cs: Některé hodnoty překročily úrovně paniky. Zašlete e-mail na kliniku nebo zavřete toto okno, pokud chcete znovu otestovat, abyste potvrdili hodnotu paniky.

source: Subject
cs: Předmět

source: Template text for the panic alert email's body. The accepted wildcards are: ${analyses}, ${lab_address}, ${sample_id}, {client_sample_id}, ${client_id} and ${sample_url}
cs: Text šablony pro tělo e-mailu panické výstrahy. Přijímané zástupné znaky jsou: ${analyses}, ${lab_address}, ${sample_id}, {client_sample_id}, ${client_id} a ${sample_url}

source: Template text for the panic alert email's subject. The accepted wildcards are: ${sample_id}, {client_sample_id} and ${client_id}
cs: Text šablony pro předmět e-mailu s panickým varováním. Přijímané zástupné znaky jsou: ${sample_id}, {client_sample_id} a ${client_id}

source: To
cs: Komu

source: Unable to send an email to alert client that some results exceeded the panic levels
cs: Nelze odeslat e-mail s upozorněním klienta, že některé výsledky překročily úrovně paniky
