Repository: pypi-data/pypi-mirror-338
Catalog: packages/open-web-calendar/open_web_calendar-1.49.tar.gz/open_web_calendar-1.49/open_web_calendar/translations/*/LC_MESSAGES/dev/api.md.po
Languages: hr

source: The API of the Open Web Calendar allows more customization than the configuration page.
hr: API otvorenog web kalendara omogućuje više prilagodbi nego stranica konfiguracije.

source: Generally, the Open Web Calendar is there to be used without restriction. You can use this API to customize the calendar on the fly.
hr: Otvoreni web kalendar se može koristiti bez ograničenja. Ovaj API možeš koristiti za prilagođavanje kalendara.

source: This section can be of use if one of these applies:
hr: Ovaj odjeljak može biti koristan u sljedećim slučajevima:

source: You are a web developer who wants to embed the Open Web Calendar.
hr: Ti si web programer koji želi ugraditi „Otvoreni web kalendar”.

source: You want to exploit the full flexibility, not just what is exposed on the configuration page.
hr: Želiš iskoristiti potpunu fleksibilnost, a ne samo ono što je moguće na stranici konfiguracije.

source: You want to use JavaScript to dynamically generate the calendar design and options.
hr: Želiš koristiti JavaScript za dinamičko generiranje dizajna i opcija kalendara.

source: You want to extend the functionality of the Open Web Calendar.
hr: Želiš proširiti funkcionalnost otvorenog web kalendara.

source: You want to use the Open Web Calendar as a proxy to request JSON events for your self-made event feed.
hr: Želiš koristiti „Otvoreni web kalendar” kao proxy za traženje JSON događaja za tvoje stvorene događaje.

source: Endpoints
hr: Identifikatori resursa

source: The basic parameters are the same at these endpoints:
hr: Osnovni parametri su isti pri ovim identifikatorima resursa:

source: `/index.html` - edit the calendar
hr: `/index.html` – uredi kalendar

source: `/about.html` - view the about page
hr: `/about.html` – pogledaj stranicu s informacijama o aplikaciji

source: `/calendar.html` - view the calendar
hr: `/calendar.html` – pogledaj kalendar

source: `/calendar.spec` - download the specification
hr: `/calendar.spec` – preuzmi specifikaciju

source: `/calendar.ics` - subscribe to the ics file
hr: `/calendar.ics` – pretplati se na ics datoteku

source: `timezone=UTC` - the timezone that you need to display the events in
hr: `timezone=UTC` – vremenska zona u kojoj će se prikazati događaji

source: `from=YYYY-MM-DD` - the start of the period in which events happen (inclusive)
hr: `from=YYYY-MM-DD` – početak razdoblja u kojem se događaji događaju (uključujući)

source: `to=YYYY-MM-DD` - the end of the period in which events happen (exclusive)
hr: `to=YYYY-MM-DD` – kraj razdoblja u kojem se događaji događaju (uključujući)

source: Parameters
hr: Parametri

source: Adding Parameters
hr: Dodavanje parametara

source: Add the parameter with a default value to the [default_specification]
hr: Dodaj parametar sa zadanom vrijednosti u [default_specification]

source: Compiling the Specification
hr: Kompiliranje specifikacije

source: Specification in the Calendar
hr: Specifikacija u kalendaru

source: Specification in the Index Page
hr: Specifikacija u stranici indeksa

source: Architecture
hr: Arhitektura

source: Below, you can find a picture of the architecture.
hr: Pogledaj sliku arhitekture.

source: The base of a calendar is the specification, given in the various forms. This specification influences all the steps.
hr: Osnova kalendara je specifikacija koja postoji u različitim oblicima. Ova specifikacija utječe na sve korake.

source: After the specification is compiled, the calendar (ics) files are downloaded from the locations on the Internet.
hr: Nakon što se specifikacija kompilira, datoteke kalendara (ics) se preuzimaju s mjesta na internetu.

source: From the calendar files, the events are generated.
hr: Događaji se generiraju iz datoteka kalendara.

source: Then, different views are chosen to display the events.
hr: Zatim se biraju različiti prikazi za prikaz događaja.

source: In the end, these lead to HTML and style changes of the calendar website.
hr: Na kraju, to dovodi do promjena HTML-a i stila web stranice kalendara.

source: In the real application, these steps are bit bit mixed up and unordered or omitted but this explains simply the basic, initial idea behind the event processing.
hr: U stvarnoj primjeni, ti su koraci pomalo pomiješani i neuređeni ili izostavljeni, ali ovo objašnjava osnovnu, početnu ideju o obradi događaja.

source: ![architecture](/assets/img/architecture.svg)
hr: ![arhitektura](/assets/img/architecture.svg)

source: Query Parameter
hr: Parametar upita

source: Change the title in a YAML specification:
hr: Promijeni naslov u YAML specifikaciji:

source: Change the title in a JSON specification:
hr: Promijeni naslov u JSON specifikaciji:

source: Change the title in a query parameter:
hr: Promijeni naslov u parametru upita:

source: Additional parameters are required for `/calendar.events.json`:
hr: Za `/calendar.events.json` su potrebni dodatni parametri:

source: Query parameters
hr: Parametri upita

source: This is intended for developers and Python-internal.
hr: Ovo je namijenjeno za programere i interne Python stvari.

source: This is an optional environment variable. Please read more about it in the [Server Configuration](../../host/configure#owc_specification).
hr: Ovo je opcionalna varijabla okruženja. Saznaj više o tome u [Konfiguracija servera](../../host/configure#owc_specification).

source: If you add a new parameter as a developer:
hr: Ako kao programer dodaš novi parametar:

source: Add tests in [features/configure-the-calendar.feature] to check that the calendar responds to the feature.
hr: Dodaj testove u [features/configure-the-calendar.feature] za provjeravanje je li kalendar odgovara na tu funkciju.

source: Add tests in [features/edit-the-calendar.feature] to make sure that the parameter can be used when a calendar is edited.
hr: Dodaj testove u [features/edit-the-calendar.feature] za osiguravanje da se parametar može koristiti kada se kalendar uređuje.
