Repository: pypi-data/pypi-mirror-338
Catalog: packages/djangocms-zb-organizations/djangocms_zb_organizations-2.1.5-py3-none-any.whl/djangocms_zb_organizations/locale/*/LC_MESSAGES/django.po
Languages: es

source: Polygon files
es: Archivos de polígonos

source: Upload .shp and .shx files for the polygons of the organization
es: Subir archivos .shp y .shx para los polígonos de la organización

source: Main Options
es: Opciones Principales

source: Location
es: Ubicación

source: Social Networks
es: Redes Sociales

source: The polygons were not processed, because the coordinates are in a different format or there was a problem processing the data.
es: Los polígonos no se procesaron porque las coordenadas están en un formato diferente o hubo un problema al procesar los datos.

source: The polygons were not processed, because the temporary directory is configured.
es: Los polígonos no fueron procesados, porque esta configurado el directorio temporal.

source: The polygons were not processed, because a .shp and a .shx file are required.
es: Los polígonos no se procesaron porque se requiere un archivo .shp y .shx.

source: The polygons were not processed, because only two files are required.
es: Los polígonos no fueron procesados, porque se requieren solo dos archivos.

source: Parent category
es: Categoría principal

source: Parent category, if it is a subcategory.
es: Categoría principal, si es una subcategoría.

source: Category name
es: Nombre de la categoría

source: Is enabled
es: Esta habilitada/o

source: Indicates if the category is enabled.
es: Indica si la categoría está habilitada.

source: Categories
es: Categorías

source: Name
es: Nombre

source: Organization name
es: Nombre de la Organización

source: acronym/initials
es: Siglas/Iniciales

source: Organization acronym/initials
es: Siglas/Iniciales de la Organización

source: Address
es: Dirección

source: Company/organization address.
es: Dirección de la empresa/organización.

source: Country
es: País

source: Country where the company/organization is located.
es: País donde se encuentra la empresa/organización.

source: Region or state where the company/organization is located.
es: Región o estado donde se encuentra la empresa/organización.

source: City or sub region where the company/organization is located.
es: Ciudad o subregión donde se encuentra ubicada la empresa/organización.

source: Phone number
es: Número de teléfono

source: Phone number of the organization/company.
es: Número de teléfono de la organización/empresa.

source: Email
es: Correo electrónico

source: Primary company/organization email.
es: Correo electrónico principal de la empresa/organización.

source: Attention schedule
es: Horario de atención

source: Keywords
es: Palabras clave

source: Keywords separated by commas, no spaces. They will be taken into account for the search of the organization on the map.
es: Palabras clave separadas por comas, sin espacios. Se tendrán en cuenta para la búsqueda de la organización en el mapa.

source: Organization logo
es: Logotipo de la organización

source: Facebook Link
es: Link de Facebook

source: Instagram Link
es: Link de Instagram

source: Twitter Link
es: Link de Twitter

source: Youtube Link
es: Link de Youtube

source: Latitude
es: Latitud

source: Latitude in which the company/organization is located.
es: Latitud en la que se encuentra la empresa/organización.

source: Longitude
es: Longitud

source: Longitude in which the company/organization is located.
es: Longitud en la que se encuentra la empresa/organización.

source: Indicates if the company/organization is enabled.
es: Indica si la empresa/organización está habilitada.

source: Organization
es: Organización

source: Organizations
es: Organizaciones

source: Contact name
es: Nombre de contacto

source: Contact phone
es: Teléfono de contacto

source: Contact email
es: Correo Electrónico de contacto

source: Indicates if the contact/organization is enabled.
es: Indica si el contacto/organización está habilitado.

source: Contact
es: Contacto

source: Contacts
es: Contactos

source: Microsite abstract
es: Resumen del micrositio

source: Summary to show on the microsite.
es: Resumen para mostrar en el micrositio.

source: Microsite content
es: Contenido del micrositio

source: Content (text) to be displayed on the microsite.
es: Contenido (texto) a mostrar en el micrositio.

source: Video URL separated by commas, no spaces. These videos will be displayed on the microsite.
es: URL del video separada por comas, sin espacios. Estos videos se mostrarán en el micrositio.

source: Indicates if the microsite is enabled.
es: Indica si el micrositio está habilitado.

source: Microsite
es: Micrositio

source: Microsites
es: Micrositios

source: Picture file
es: Archivo de imagen

source: Represents the image file found in media (Filer).
es: Representa el archivo de imagen que se encuentra en los medios (Archivador).

source: Indicates if the picture/organization is enabled.
es: Indica si la imagen/organización está habilitada.

source: Microsite owner
es: Propietario del micrositio

source: Microsite to which the catalog belongs.
es: Microsite al que pertenece el catálogo.

source: Product/Service name
es: Nombre del producto/servicio

source: Name of the product or service.
es: Nombre del producto o servicio.

source: Short description
es: Breve descripción

source: Description of the product or service offered.
es: Descripción del producto o servicio ofrecido.

source: Catalog Picture
es: Imagen del catálogo

source: Indicates if the product or service is enabled.
es: Indica si el producto o servicio está habilitado.

source: Catalog
es: Catálogo

source: Catalogs
es: Catálogos

source: Filter by category
es: Filtrar por categoría

source: Template dir
es: Directorio de plantilla

source: Directory that contains the templates that the plugin will use.
es: Directorio que contiene las plantillas que usará el complemento.

source: Polygons
es: Polygonos

source: Location Area Coordinates
es: Coordenadas del área de ubicación

source: There are no logos of organizations or companies to display.
es: No hay logotipos de organizaciones o empresas para mostrar.

source: Filter
es: Filtro

source: Filter by:
es: Filtrar por:

source: Select
es: Seleccionar

source: City
es: Ciudad

source: keyword
es: Palabra clave

source: Category
es: Categoría

source: Product or Service
es: Producto o servicio

source: Subcategories:
es: Subcategorías

source: Send
es: Enviar

source: Contains:
es: Contiene:

source: You can type multiple words separated by commas.
es: Puede escribir varias palabras separadas por comas.

source: Remove Filter
es: Eliminar Filtro

source: There are no organizations or companies to display
es: No hay organizaciones o empresas para mostrar

source: Organization or Branch Data
es: Datos de la organización o sucursal

source: See Microsite
es: Ver Micrositio

source: No catalog found.
es: No se ha encontrado ningún catálogo.
