Repository: pypi-data/pypi-mirror-338
Catalog: packages/open-web-calendar/open_web_calendar-1.49-py3-none-any.whl/open_web_calendar/translations/*/LC_MESSAGES/dev/api.md.po
Languages: cs

source: The API of the Open Web Calendar allows more customization than the configuration page.
cs: Open Web Calendar API umožňuje více přizpůsobení než konfigurační stránka.

source: Generally, the Open Web Calendar is there to be used without restriction. You can use this API to customize the calendar on the fly.
cs: Obecně je možné Open Web Calendar používat bez omezení. Toto API je možné použít pro úpravu kalendáře za běhu.

source: This section can be of use if one of these applies:
cs: Tato sekce může být užitečná pokud platí jedno z níže uvedených:

source: You are a web developer who wants to embed the Open Web Calendar.
cs: Jste webový vývojář a chcete vložit Open Web Calendar.

source: You want to exploit the full flexibility, not just what is exposed on the configuration page.
cs: Chcete využít plnou flexibilitu, ne pouze to co je dostupné na konfigurační stránce.

source: You want to use JavaScript to dynamically generate the calendar design and options.
cs: Chcete použít JavaScript pro dynamické generování designu a možností kalendáře.

source: You want to extend the functionality of the Open Web Calendar.
cs: Chcete rozšířit funkcionalitu Open Web Calendar.

source: You want to use the Open Web Calendar as a proxy to request JSON events for your self-made event feed.
cs: Chcete použít Open Web Calendar jako proxy pro požadavky JSON událostí pro Váš vlastní feed.

source: Endpoints
cs: Koncové body

source: The basic parameters are the same at these endpoints:
cs: Základní parametry u těchto koncových bodů jsou stejné:

source: `/index.html` - edit the calendar
cs: `/index.html` - upravit kalendář

source: `/about.html` - view the about page
cs: `/about.html` - zobrazení informací o

source: `/calendar.html` - view the calendar
cs: `/calendar.html` - zobrazení kalendáře

source: `/calendar.spec` - download the specification
cs: `/calendar.spec` - stažení specifikace

source: `/calendar.ics` - subscribe to the ics file
cs: `/calendar.ics` - přihlášení k odběru ics souboru

source: `/calendar.events.json` - FLEXIBLE - get the events as JSON Please note that you CAN use this but you cannot be sure that the JSON schema remains the same. If you want that, add tests.
cs: `/calendar.events.json` - FLEXIBINÍ - získá události jako JSON. Pozor! Toto LZE použít, nicméně neni zajištěno že schéma JSON zůstane stejné. V případě použití přidejte testy.

source: `timezone=UTC` - the timezone that you need to display the events in
cs: `timezone=UTC` - časové pásme ve kterém je potřeba zobrazit události

source: `from=YYYY-MM-DD` - the start of the period in which events happen (inclusive)
cs: `from=YYYY-MM-DD` - začátek období daných událostí (včetně)

source: `to=YYYY-MM-DD` - the end of the period in which events happen (exclusive)
cs: `to=YYYY-MM-DD` - konec období daných událostí (mimo)

source: Parameters
cs: Parametry

source: All configuration parameters are described sufficiently in the [default_specification]. That is the reference. E.g. if you find the parameter `title` in the [default_specification], you have several options:
cs: Všechny parametry konfigurace jsou dostatečně popsány v [default_specification]. To je vzor. Například, pokud naleznete parametr `title` v [default_specification], máte několik možností:

source: Adding Parameters
cs: Přidání parametrů

source: Add the parameter with a default value to the [default_specification]
cs: Přidejte parametr s výchozí hodnotou do [default_specification]

source: Add an implementation, depending on its use in the `app.py` or the templates of the JavaScript files. The specification is already available in all of them to use.
cs: Přidejte implementaci v závislosti na jejím použití do `app.py` nebo šablon JavaScriptových souborů. Použitelná specifikace je již k dispozici ve všech.

source: Compiling the Specification
cs: Kompilace specifikace

source: Specification in the Calendar
cs: Specifikace v kalendáři

source: Specification in the Index Page
cs: Specifikace na stránce Indexu

source: Architecture
cs: Architektura

source: Below, you can find a picture of the architecture.
cs: Níže najdete obrázek architektury.

source: The base of a calendar is the specification, given in the various forms. This specification influences all the steps.
cs: Základem kalendáře je specifikace, která je dána v různých formách. Tato specifikace ovlivňuje všechny kroky.

source: After the specification is compiled, the calendar (ics) files are downloaded from the locations on the Internet.
cs: Poté, co je specifikace zkompilována, jsou (ics) soubory kalendáře staženy z internetu.

source: From the calendar files, the events are generated.
cs: Události jsou generovány ze souborů kalendáře.

source: Then, different views are chosen to display the events.
cs: Poté jsou vybrány různé pohledy na zobrazení událostí.

source: In the end, these lead to HTML and style changes of the calendar website.
cs: Toto nakonec vede k HTML a stylovým změnám webové stránky kalendáře.

source: In the real application, these steps are bit bit mixed up and unordered or omitted but this explains simply the basic, initial idea behind the event processing.
cs: V reálných aplikacích jsou tyto kroky trochu smíchány a neseřazeny nebo vynechány, ale to vysvětluje jednoduše základní, počáteční myšlenku zpracování události.

source: Query Parameter
cs: Parametr dotazu

source: Change the title in a YAML specification:
cs: Změna názvu ve specifikaci YAML:

source: Change the title in a JSON specification:
cs: Změna názvu ve specifikaci JSON:

source: Change the title in a query parameter:
cs: Změna názvu v parametru dotazu:

source: Additional parameters are required for `/calendar.events.json`:
cs: Další parametry jsou požadovány pro `/calendar.events.json`:

source: You can change the calendar behavior and looks with parameters. If the same parameter is specified in different places, the earlier place listed below has the highest precedence. These are the places to specify parameters:
cs: Pomocí parametrů můžete změnit chování a vzhled kalendáře. Pokud je stejný parametr specifikován v různých místech, předchozí místo uvedené níže má nejvyšší přednost. Zde jsou místa pro zadání parametrů:

source: Query parameters
cs: Parametry požadavků

source: All parameters to the calendar url are put into the specification. The query parameters have the highest precedence.
cs: Všechny parametry do URL kalendáře jsou ve specifikaci. Parametry požadavku mají nejvyšší přednost.

source: If you specify this query parameter, the editor configuration is loaded from this url, too. Query parameters are still more important than what is written in this file. The source format can be YAML or JSON.
cs: Pokud zadáte tento parametr dotazu, konfigurace editoru je načtena z této adresy URL. Parametry dotazu jsou stále důležitější než to, co je napsáno v tomto souboru. Zdrojový formát může být YAML nebo JSON.

source: This is intended for developers and Python-internal.
cs: Určeno pro vývojáře a Python-internal.

source: This is an optional environment variable. Please read more about it in the [Server Configuration](../../host/configure#owc_specification).
cs: Jedná se o volitelnou proměnnou prostředí. Přečtěte si více v [Konfiguraci serveru](../../host/configure#owc_specification).

source: This file contains the default parameters. They must not be hard-coded in the source code. All parameters are listed and documented there so this file can be used for reference. Do not modify this file, instead use the `OWC_SPECIFICATION` environment variable.
cs: Tento soubor obsahuje výchozí parametry. Nesmí být vloženy přímo do zdrojového kódu. Všechny parametry jsou uvedeny a zdokumentovány zde, takže tento soubor lze použít pro referenci. Neupravujte tento soubor, použijte místo toho `OWC_SPECIFICATION` proměnnou prostředí.

source: If you add a new parameter as a developer:
cs: Pokud přidáte nový parametr jako vývojář:

source: Add tests in [features/configure-the-calendar.feature] to check that the calendar responds to the feature.
cs: Přidejte testy v [features/configure-the-calendar.feature] pro kontrolu, že kalendář reaguje na danou funkci.

source: Add tests in [features/edit-the-calendar.feature] to make sure that the parameter can be used when a calendar is edited.
cs: Přidejte testy v [features/edit-the-calendar.feature], pro kontrolu, že parametr lze použít při úpravě kalendáře.

source: [app.py][app.py-81] compiles the specification from the given parameters in `get_specification()`. In the [template][dhtmlx-23] you can access the specification through the `specification` variable. The specification is available to JavaScript as the `specification` variable.
cs: [app.py][app.py-81] kompiluje specifikaci z uvedených parametrů v `get_specification()`. V [template][dhtmlx-23] můžete přistupovat ke specifikaci pomocí proměnné `specification`. Specifikace je k dispozici pro JavaScript jako proměnná `specification`.

source: [JavaScript Customization](../javascript)
cs: [Přizpůsobení v JavaScriptu](../javascript)

source: The default specification is available before the calendar is built via JavaScript in the `configuration.default_specification` variable. There is a [getSpecification()] function which created the specification from the inputs. Generally, the `specification` variable should be used.
cs: Výchozí specifikace je k dispozici před sestavením kalendáře v JavaScriptu v `configuration.default_specification` proměnné. Funkce [getSpecification()] vytvořila specifikaci ze vstupů. Obecně by měla být použita proměnná `specification`.
