Repository: pypi-data/pypi-mirror-338
Catalog: packages/open-web-calendar/open_web_calendar-1.49.tar.gz/open_web_calendar-1.49/open_web_calendar/translations/*/LC_MESSAGES/host/configure.md.po
Languages: cs

source: Configure a hosted instance.
cs: Nakonfigurujte hostovanou instanci.

source: If you want to change the Open Web Calendar to serve your needs, this is well possible. You can choose to
cs: Je možné změnit Open Web Calendar pro vlastní potřeby. Můžete si vybrat

source: Change how the default calendar looks.
cs: Změnit jak vypadá základní kalendář.

source: Change how the server works.
cs: Změnit nastavení serveru.

source: Server Configuration
cs: Nastavení serveru

source: Configuring the Default Calendar
cs: Nastavení základního kalendáře

source: Configuring the Server
cs: Konfigurace serveru

source: Environment variables only influence the running of the server. These environment variables can be used to configure the service:
cs: Proměnné prostředí ovlivňují pouze chod serveru. Tyto proměnné prostředí mohou být použity pro konfiguraci služby:

source: default `5000`, default `80` in the Docker container
cs: default `5000`, default `80` v Docker kontejneru

source: The port that the service is running on.
cs: Port, na kterém služba běží.

source: Serve on HTTP port: `PORT=80`
cs: Poskytovat na HTTP portu: `PORT=80`

source: default `4`, only for the Docker container
cs: default `4`, pouze pro Docker kontejner

source: The number of parallel workers to handle requests.
cs: Počet paralelních procesů pro zpracování požadavků.

source: Only use one worker: `WORKERS=1`
cs: Použít pouze jeden proces: `WORKERS=1`

source: Seconds to cache the calendar files that get downloaded to reduce bandwidth and delay.
cs: Kolik sekund jsou v cache kalendáře stažené soubory, pro snížení šířky pásma a zpoždění.

source: Refresh fast: `CACHE_REQUESTED_URLS_FOR_SECONDS=10`
cs: Rychle obnovit: `CACHE_REQUESTED_URLS_FOR_SECONDS=10`

source: Set the debug flag for the app.
cs: Nastavte přepínač ladění pro aplikaci.

source: The Open Web Calendar uses libraries whose behavior can be further customized.
cs: Open Web Calendar využívá knihovny, jejichž chování lze hlouběji přizpůsobit.

source: **Flask** has **[more environment variables](https://flask.palletsprojects.com/en/3.0.x/config/)** available to configure how the application serves content.
cs: **Flask** má **[více proměnných prostředí](https://flask.palletsprojects.com/en/3.0.x/config/) ** k dispozici pro konfiguraci, jak aplikace poskytuje obsah.

source: SSRF Protection with a Proxy Server
cs: Ochrana SSRF s proxy serverem

source: [Prevent SSRF using a Tor proxy](../docker#preventing-ssrf-attacks-using-a-tor-proxy)
cs: [Prevence SSRF pomocí Tor proxy](../docker#preventing-ssrf-attacks-using-a-tor-proxy)

source: **Requests** is used the get the `.ics` files. You can [configure a proxy](#ssrf-protection-with-a-proxy-server).
cs: **Requests** se používá pro získání `.ics` souborů. Můžete [konfigurovat proxy](#ssrf-protection-with-a-proxy-server).

source: The configuration of all calendars is rooted in the [default_specification]. All those values can be changed through a copy of this file hosted on the web through the calendar parameter `specification_url`. Each parameter should be documented in [default_specification].
cs: Konfigurace všech kalendářů vychází z [default_specification.yml]. Všechny tyto hodnoty mohou být změněny skrze kopii tohoto souboru na hostovaném webu skrze parametr kalendáře `specification_url`. Každý parametr by měl být zdokumentován v [default_specification.yml].

source: To modify **all calendars** hosted on your instance, use the [OWC_SPECIFICATION] environment variable. Calendars still override some values for their configuration. Those which they do not override are affected by the default specification. Not all values are exposed to the configuration page to be changed. Those values can still be changed in the `specification_url` and the query parameters.
cs: Chcete-li upravit **všechny kalendáře** hostované na vaší instanci, použijte proměnnou prostředí [OWC_SPECIFICATION]. Kalendáře stále přepíšou některé hodnoty pro jejich konfiguraci. Ty, které nejsou přepsány jsou ovlivněny výchozí specifikací. Ne všechny hodnoty jsou dostupné na stránce konfigurace. Tyto hodnoty lze změnit v `specification_url` a pomocí parametrů požadavků.

source: You might want to change the following values.
cs: Můžete změnit následující hodnoty.

source: The title of your website.
cs: Název Vašeho webu.

source: This is the default language. You might want to change this to serve the configuration page better to a local audience.
cs: Toto je výchozí jazyk. Pro lepší zpřístupnění konfigurační stránky místním uživatelům lze změnit.

source: This is a link to the website icon.
cs: Zde je odkaz na ikonu webu.

source: If you made changes, you are legally required to disclose them to visitors. Please adjust the link or contribute them back to the main project.
cs: Pokud jste provedli změny, jste ze zákona povinni je sdělit návštěvníkům. Prosím, upravte odkaz, nebo je přispějte zpět do hlavního projektu.

source: If you want to redirect to contribute to your project.
cs: Pokud chcete přesměrovat na příspěvek pro Váš projekt.

source: If you host this service yourself, you can use the default [privacy policy][privacy-policy].
cs: Pokud službu hostujete sami, můžete použít výchozí [zásady ochrany osobních údajů][privacy-policy].

source: If for some reason you decide to collect data i.e. in the HTTPS proxy or log IP-addresses, then you need to create your own privacy policy. You can link to the one of this project.
cs: Pokud z nějakého důvodu se rozhodnete shromažďovat data, tj. v HTTPS proxy nebo uchovávat IP adresy, musíte vytvořit vlastní zásady ochrany osobních údajů. Můžete odkazovat na jeden z těchto projektů.

source: More Values
cs: Více hodnot

source: There are loads more values that can be changed. Please refer to the [default_specification]. These values are all documented. Please use the [OWC_SPECIFICATION] environment variable to change them.
cs: Je plno velké množství které lze změnit. Postupujte podle [default_specification]. Tyto hodnoty jsou všechny zdokumentovány. Používejte proměnnou prostředí [OWC_SPECIFICATION] pro jejich změnu.

source: The clients divided by comma that are allowed to access the Open Web Calendar. You will see this text if you try to access the service and you are not allowed:
cs: Klienti, oddělení čárkami, kteří mají přístup k Open Web Calendar. Tento text uvidíte, pokud se pokusíte získat přístup k službě a nejste oprávněni:

source: permit only the same computer: `ALLOWED_HOSTS=localhost`
cs: povolit pouze stejný počítač: `ALLOWED_HOSTS=localhost`

source: permit several hosts: `ALLOWED_HOSTS=192.168.0.1,192.168.2,api.myserver.com`
cs: povolit několik hostitelů: `ALLOWED_HOSTS=192.168.0.1,192.168.2,api.myserver.com`

source: permit everyone to access the server (default): `ALLOWED_HOSTS=` or `ALLOWED_HOSTS=*`
cs: povolit každému přístup k serveru (výchozí): `ALLOWED_HOSTS=` nebo `ALLOWED_HOSTS=*`

source: This functionality is provided by [flask-allowed-hosts].
cs: Tato funkce je poskytována [flask-allowed-hosts].

source: `OWC_SPECIFICATION` is an optional environment variable.
cs: `OWC_SPECIFICATION` je volitelná proměnná prostředí.

source: It can be a **path** to a file containing valid YAML or JSON.
cs: Může být **cesta** do souboru obsahující platné YAML nebo JSON.

source: It can be a **string** containing valid YAML or JSON.
cs: Může to být **string** obsahující platné YAML nebo JSON.

source: Setting `OWC_SPECIFICATION` allows you to replace default values for all calendars.
cs: Nastavení `OWC_SPECIFICATION` umožňuje nahradit výchozí hodnoty pro všechny kalendáře.

source: In following example, the title for all calendars that do not set their own title will be changed.
cs: V následujícím příkladu se změní název pro všechny kalendáře, které nemají svůj vlastní titul.

source: default `false`, values `true` or `false`, always `false` in the Docker container
cs: default `false`, hodnoty `true` nebo `false`, vždy `false` v Docker kontejneru

source: This is a comma separated list of encryption keys. These can be used to hide sensitive information of URLs.
cs: Jedná se o čárkou oddělený seznam šifrovacích klíčů. To lze použít k skrytí citlivé informace v URL.

source: Disable encryption (default): `OWC_ENCRYPTION_KEYS=`
cs: Zakázat šifrování (výchozí): `OWC_ENCRYPTION_KEYS=`

source: Use one key: `OWC_ENCRYPTION_KEYS='Pj...48='`
cs: Použít jeden klíč: `OWC_ENCRYPTION_KEYS='Pj...48='`

source: Use multiple keys: `OWC_ENCRYPTION_KEYS='Pj...48=,cx...Fw='` If you use multiple keys, only the first one encrypts the data. The others are only used to decrypt the data.
cs: Použít více klíčů: `OWC_ENCRYPTION_KEYS='Pj...48=,cx...Fw='` Pokud používáte více klíčů, pouze první zašifruje data. Ostatní se používají pouze k dešifrování dat.

source: You can generate a new key by visiting your instance of the Open Web Calendar on the page [/new-key] or by running this command:
cs: Můžete vygenerovat nový klíč navštívením své instance Open Web Calendar na stránce [/new-key] nebo spuštěním tohoto příkazu:

source: The Open Web Calendar relies on proxy servers for these features:
cs: Open Web Calendar se spoléhá na proxy servery pro tyto funkce:

source: **Access Control and Users** To restrict who can use the Open Web Calendar, you can use `nginx` or `apache` as a reverse proxy in front of it. YuNoHost is another self-hosting option to restrict access.
cs: ** Řízení přístupu a uživatelé** Chcete-li omezit, kdo může použít Open Web Calendar, můžete použít `nginx` nebo `apache` jako reverzní proxy. YuNoHost je další volba vlastního hostingu pro omezení přístupu.

source: **HTTPS Encryption** This can be done by `nginx`, `apache` or `caddy`.
cs: ** HTTPS Šifrování** To lze zavést pomocí `nginx`, `apache` nebo `caddy`.

source: **More Advanced Caching** Basic caching is handeled by the Open Web Calendar. For more advanced cache configuration, use a proxy server like `squid`. Have a look in the documentation below on how to make the Open Web Calendar access the web only through a proxy.
cs: **Pokročilý caching** Základní caching je spravován v rámci Open Web Calendar. Pro pokročilou konfiguraci cache použijte proxy server jako `squid`. Podívejte se na dokumentaci níže, jak vytvořit Open Web Calendar s přístupem na web pouze prostřednictvím proxy.

source: **Restricting Access to Calendars** By default, the Open Web Calendar does not restrict which calendars to show. Use the proxy server to filter the calendars. If you run the Open Web Calendar behind a firewall with other web services, setting up a proxy is necessary to protect from SSRF attacks.
cs: **Omezení přístupu k kalendářům** Ve výchozím nastavení Open Web Calendar neomezuje, které kalendáře jsou zobrazeny. Použijte proxy server pro filtrování kalendářů. Pokud spustíte Open Web Calendar přes firewall s jinými webovými službami, nastavení proxy je nutné pro chranu před útoky SSRF.

source: Squid as a Proxy Server
cs: Squid jako proxy server

source: The [Squid] Proxy and Cache is flexible and configurable. You can use it in front of the Open Web Calendar to configure access and customize caching.
cs: [Squid] Proxy a cache je flexibilní a konfigurovatelný. Můžete jej použít s Open Web Calendar pro konfiguraci přístupu a přizpůsobení cachingu.

source: After you have installed the [Squid] Proxy, add this file into the `conf.d` directory. Squid will load it automatically then.
cs: Poté, co jste nainstalovali [Squid] proxy, přidejte tento soubor do adresáře `conf.d`. Squid jej automaticky načte.

source: In Linux, create `/etc/squid/conf.d/open-web-calendar.conf`:
cs: V Linuxu vytvořte `/etc/squid/conf.d/open-web-calendar.conf`:

source: The list above denies the Open Web Calendar access to all known local/internal networks. If you have your own local network (IPv4 or IPv6), add it to the list above to be sure.
cs: Seznam výše odpírá Open Web Calendar přístup ke všem známým lokálním/interním sítím. Pokud máte vlastní lokální síť (IPv4 nebo IPv6), přidejte jej do seznamu výše.

source: On Linux, you can install the file with this command:
cs: Na Linuxu můžete nainstalovat soubor tímto příkazem:

source: Then, restart the squid proxy.
cs: Poté restartujte squid proxy.

source: Set the environment variables to tell the Open Web Calendar to use the Squid proxy installed on `localhost`. Setting this variable changes depending on how you run the Open Web Calendar.
cs: Nastavte proměnné prostředí, které donutí Open Web Calendar použít Squid proxy nainstalováno na `localhost`. Nastavení této proměnné se mění v závislosti na tom, jak provozujete Open Web Calendar.

source: If you use the [Python Setup][1], you can set the environment variables for the server like this:
cs: Pokud používáte [Python nastavení][1], můžete nastavit proměnné prostředí pro server následně:

source: Note
cs: Poznámka

source: New versions of the Open Web Calendar can add new configuration parameters. Placing your changes in this variable instead of changing the `default_specification` file will ensure that you do not break the Open Web Calendar in a future version.
cs: Nové verze Open Web Calendar mohou přidávat nové konfigurační parametry. Uvedení změn v této proměnné namísto změny souboru `default_specification` zajistí, že v budoucí verzi bude Open Web Calendar funkční.

source: Operating System
cs: Operační systém

source: Squid is avaiable for all major platforms. For the commands and paths of this tutorial, we assume you run Squid on Debain/Ubuntu. The commands might work on other systems, but that is not tested.
cs: Squid je dostupný pro všechny hlavní platformy. Pro příkazy a cesty tohoto návodu předpokládáme, že Squid běží na Debain/Ubuntu. Příkazy mohou pracovat na jiných systémech, ale to není testováno.

source: The Open Web Calendar can be used to access the local network behind a firewall, see [Issue 250](https://github.com/niccokunzmann/open-web-calendar/issues/250). This free access is intended to show calendars from everywhere. Since `requests` is used by the Open Web Calendar, it can use a proxy as described in the [`requests` documentation](https://requests.readthedocs.io/en/latest/user/advanced/#proxies). The proxy can then handle the filtering.
cs: Open Web Calendar lze použít pro přístup k místní síti za firewallem, viz [Issue 250](https://github.com/niccokunzmann/open-web-calendar/issues/250). Tento volný přístup je určen pro zobrazení kalendáře odevšad. Vzhledem k tomu, že je použit `requests` v Open Web Calendar, může být proxy použita, jak je popsáno v [`requests` dokumentaci](https://requests.readthedocs.io/en/latest/user/advanced/#proxies). Proxy může potom provést filtrování.
