Repository: pypi-data/pypi-mirror-338
Catalog: packages/open-web-calendar/open_web_calendar-1.49.tar.gz/open_web_calendar-1.49/open_web_calendar/translations/*/LC_MESSAGES/host/self.md.po
Languages: uk

source: There are various ways to host the Open Web Calendar yourself and customize the deployment.
uk: Існують різні способи самостійно розмістити Open Web Calendar і налаштувати розгортання.

source: Self-Hosting & Deployment
uk: Самостійне розміщення та розгортання

source: You do not have to host the Open Web Calendar yourself but you are encouraged to. It is intended to work behind a company firewall, through a proxy and also without access to the Internet.
uk: Вам не обов’язково самостійно розміщувати відкритий веб-календар, але рекомендується це зробити. Він призначений для роботи за брандмауером компанії, через проксі, а також без доступу до Інтернет.

source: Several hosting options are already documented. We are grateful if you can add your favorite one, too.
uk: Кілька варіантів розміщення вже задокументовано. Ми будемо вдячні, якщо ви також можете додати свій улюблений.

source: You can create a fork of this repository which automatically deploys to [Vercel](https://vercel.com/):
uk: Ви можете створити форк цього репозиторію, який автоматично розгортається на [Vercel](https://vercel.com/):

source: Alternatively you can create a one off deploy by cloning this repository and running `npx vercel` at the root.
uk: Крім того, ви можете створити одноразове розгортання, клонувавши це сховище та запустивши `npx vercel` у корені.

source: You can deploy the app using [Heroku](https://heroku.com).
uk: Ви можете розгорнути програму за допомогою [Heroku](https://heroku.com).

source: Heroku uses [gunicorn](https://gunicorn.org/) to run the server, see the [Procfile](https://github.com/niccokunzmann/open-web-calendar/blob/master/Procfile).
uk: Heroku використовує [gunicorn](https://gunicorn.org/) для запуску сервера, див. [Procfile](https://github.com/niccokunzmann/open-web-calendar/blob/master/Procfile).

source: The Open Web Calendar has been integrated into [Cloudron](https://www.cloudron.io/).
uk: Відкритий веб-календар інтегровано в [Cloudron](https://www.cloudron.io/).

source: [Cloudron Documentation](https://docs.cloudron.io/apps/openwebcalendar/)
uk: [Документація Cloudron](https://docs.cloudron.io/apps/openwebcalendar/)

source: [Cloudron Repository](https://git.cloudron.io/cloudron/openwebcalendar-app)
uk: [Cloudron Репозиторій](https://git.cloudron.io/cloudron/openwebcalendar-app)

source: The Open Web Calendar is available as an app for [YunoHost](https://yunohost.org/).
uk: Відкритий веб-календар доступний як додаток для [YunoHost](https://yunohost.org/).

source: [App Description](https://apps.yunohost.org/app/open-web-calendar)
uk: [Опис програми](https://apps.yunohost.org/app/open-web-calendar)

source: [Repository](https://github.com/YunoHost-Apps/open-web-calendar_ynh/blob/master/ALL_README.md)
uk: [Репозиторій](https://github.com/YunoHost-Apps/open-web-calendar_ynh/blob/master/ALL_README.md)

source: Update Notifications
uk: Сповіщення про оновлення

source: If you wish to receive notifications about new updates of the software, watch the [GitHub repository](https://github.com/niccokunzmann/open-web-calendar/).
uk: Якщо ви хочете отримувати сповіщення про нові оновлення програмного забезпечення, перегляньте [репозиторій GitHub](https://github.com/niccokunzmann/open-web-calendar/).

source: **Choose a hoster.** These are listed below.
uk: **Виберіть хостера.** Вони перераховані нижче.

source: [**Read about Configuration**](../configure).
uk: [**Прочитайте про конфігурацію**](../configure).

source: You can choose to run the Open Web Calendar installed as a Python package from PyPI. To do this, have a look at [the documentation](../pypi).
uk: Ви можете запустити Open Web Calendar, встановлений як пакет Python із PyPI. Для цього перегляньте [документацію](../pypi).

source: If you run your own server, you can choose to run the Open Web Calendar with Docker. Building, running and updating are [documented here](../docker).
uk: Якщо ви використовуєте власний сервер, ви можете запустити Open Web Calendar with Docker. Створення, запуск і оновлення [задокументовано тут](../docker).
