Repository: pypi-data/pypi-mirror-338
Catalog: packages/artd-partner/artd_partner-1.0.14.tar.gz/artd_partner-1.0.14/artd_partner/locale/*/LC_MESSAGES/django.po
Languages: es

source: Spanish
es: Español

source: English
es: Inglés

source: Partner
es: Asociado

source: Status
es: Estado

source: Timestamps
es: Estampas de tiempo

source: Headquarter
es: Sede

source: Position
es: Cargo

source: Coworker
es: Colaborador

source: ArtD Partner
es: Partner

source: Created at
es: Creado en

source: Updated at
es: Actualizado en

source: Slug of headquarter
es: Slug de la sede

source: Name
es: Nombre

source: Name of partner
es: Nombre del asociado

source: Dni
es: Documento de identidad

source: DNI of partner
es: Documento de identidad del asociado

source: Email
es: Correo electrónico

source: Email of partner
es: Correo electrónico del asociado

source: City
es: Ciudad

source: City of partner
es: Ciudad del asociado

source: Address
es: Dirección

source: Address of partner
es: Dirección del asociado

source: Partners
es: Asociados

source: Name of headquarter
es: Nombre de la sede

source: Address of headquarter
es: Dirección de la sede

source: City of headquarter
es: Ciudad de la sede

source: phone
es: Teléfono

source: Phone of headquarter
es: Teléfono de la sede

source: partner
es: Asociado

source: Partner of headquarter
es: Asociado de la sede

source: Headquarters
es: Sedes

source: Name of position
es: Nombre del cargo

source: Positions
es: Cargos

source: First name
es: Nombres

source: First name of coworker
es: Nombres del colaborador

source: Last name
es: Apellidos

source: Last name of coworker
es: Apellidos del colaborador

source: DNI of coworker
es: Documento de identidad del colaborador

source: email
es: Correo electrónico

source: Email of coworker
es: Correo electrónico del colaborador

source: Phone
es: Teléfono

source: Phone of coworker
es: Teléfono del colaborador

source: Headquarter of coworker
es: Sede del colaborador

source: Position of coworker
es: Cargo del colaborador

source: Coworkers
es: Colaboradores
