Repository: pypi-data/pypi-mirror-338
Catalog: packages/open-web-calendar/open_web_calendar-1.49-py3-none-any.whl/open_web_calendar/translations/*/LC_MESSAGES/contributing.md.po
Languages: cs, de, hr, uk

source: You can improve the project yourself. Get started here.
cs: Tento projekt můžete sami vylepšit. Začněte zde.
de: Du kannst das Projekt verbessern. Hier ist der Anfang.
hr: Pomogni poboljšati projekt. Započni ovdje.
uk: Ви можете вдосконалити проект самостійно. Почніть тут.

source: There are several ways in which you can help this project:
cs: Je mnoho možností jak můžete tento projekt podpořit:
de: Es gibt verschiedene Wege, dem Projekt zu helfen:
hr: Ovom projektu možeš pomoći na nekoliko načina:
uk: Є кілька способів, якими ви можете допомогти цьому проекту:

source: [Use it](https://open-web-calendar.hosted.quelltext.eu) and [report errors](https://github.com/niccokunzmann/open-web-calendar/issues)
cs: [Použijte](https://open-web-calendar.hosted.quelltext.eu) a [nahlašte chyby](https://github.com/niccokunzmann/open-web-calendar/issues)
de: [Benutze es](https://open-web-calendar.hosted.quelltext.eu) und [melde Fehler](https://github.com/niccokunzmann/open-web-calendar/issues)
hr: [Koristi ga](https://open-web-calendar.hosted.quelltext.eu) i [prijavi greške](https://github.com/niccokunzmann/open-web-calendar/issues)
uk: [Використовуйте](https://open-web-calendar.hosted.quelltext.eu) і [повідомляйте про помилки](https://github.com/niccokunzmann/open-web-calendar/issues)

source: Have a look at [open issues](https://github.com/niccokunzmann/open-web-calendar/issues) e.g. those especially to get started, labeled [good first issue](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22), leave a note and work on it.
cs: Prohlédněte si [otevřené problémy](https://github.com/niccokunzmann/open-web-calendar/issues), například ty označené [good first issue](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22), pro inspiraci jak začít, zanechte poznámku a pracujte na řešení.
de: Schau Dir [offene Fehlermeldungen (Issues) an](https://github.com/niccokunzmann/open-web-calendar/issues), z.B. die zum Einsteigen: [good first issue](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22), schreib einen Kommentar und leg los.
hr: Pogledaj [otvorene probleme](https://github.com/niccokunzmann/open-web-calendar/issues), na primjer one koja su označena kao [good first issue](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22), napiši bilješku i počni ih rješavati.
uk: Перегляньте [відкриті проблеми](https://github.com/niccokunzmann/open-web-calendar/issues), напр. ті, які спеціально призначені для початку, з позначкою [хороший перший випуск](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issues%22), залиште записку та попрацюйте над нею.

source: Contribute ♥️
cs: Přispějte ♥️
de: Beitragen ♥️
hr: Doprinesi ♥️
uk: Внести свій внесок ♥️

source: [Fund development & maintenance - Polar](https://polar.sh/niccokunzmann/open-web-calendar)
cs: [Fond vývoje & údržby - Polar](https://polar.sh/niccokunzmann/open-web-calendar)
de: [Entwicklung und Wartung mit Polar fördern](https://polar.sh/niccokunzmann/open-web-calendar)
hr: [Financiraj razvoj i održavanje – Polar](https://polar.sh/niccokunzmann/open-web-calendar)
uk: [Розробка та підтримка фонду - Polar](https://polar.sh/niccokunzmann/open-web-calendar)

source: [Fund costs - Open Collective](https://opencollective.com/open-web-calendar/)
cs: [Příspěvky na náklady - Open Collective](https://opencollective.com/open-web-calendar/)
de: [Mit Kosten auf Open Collective helfen](https://opencollective.com/open-web-calendar/)
hr: [Financiraj troškove – Open Collective](https://opencollective.com/open-web-calendar/)
uk: [Витрати коштів - Open Collective](https://opencollective.com/open-web-calendar/)

source: [Fund sustainability - GitHub Sponsors](https://github.com/sponsors/niccokunzmann)
cs: [Příspěvky na udržitelnost - GitHub Sponzors](https://github.com/sponsors/niccokunzmann)
de: [Nachhaltigkeit fördern - GitHub Sponsors](https://github.com/sponsors/niccokunzmann)
hr: [Financiraj održivost – GitHub sponsori](https://github.com/sponsors/niccokunzmann)
uk: [Стійкість фонду - Спонсори GitHub](https://github.com/sponsors/niccokunzmann)

source: [Translate this project to your language](../dev/translate)
cs: [Přeložte tento projekt do svého jazyka](../dev/translate)
de: [Übersetze das Projekt in Deine Sprache](../dev/translate)
hr: [Prevedi ovaj projekt na svoj jezik](../dev/translate)
uk: [Перекладіть цей проект на вашу мову](../dev/translate)

source: If you customized a calendar, please consider [contributing it as a template](../templates) for others to use.
cs: Pokud jste přizpůsobili kalendář, zvažte prosím jeho [zveřejnění jako šablonu](../templates) pro použití ostatními uživateli.
de: Wenn Du einen Kalender erstellt hast, [füge ihn als Beispiel hinzu](../templates), damit andere ihn nutzen können.
hr: Ako prilagodiš kalendar, [doprinesi ga kao predložak](../templates) kako bi ga drugi mogli koristiti.
uk: Якщо ви налаштували календар, [надайте його як шаблон](../templates), щоб інші могли використовувати його.

source: If you are part of a company depending on the Open Web Calendar, please contact Nicco Kunzmann, the maintainer:
cs: Pokud jste součástí společnosti používající Open Web Calendar, kontaktujte prosím Nicco Kunzmanna, správce:
de: Solltest Du als Teil einer Firma den Offenen Web-Kalender nutzen, dann kontaktiere bitte Nicco Kunzmann, den Haupt-Entwickler:
hr: Ako si dio tvrtke koja ovisi o aplikaciji „Otvoreni web kalendar”, kontaktiraj održavatelja Nicco Kunzmanna:
uk: Якщо ви є частиною компанії, що залежить від відкритого веб-календаря, будь ласка, зв’яжіться з Нікко Кунцманном, супроводжувачем:

source: You need features added.
cs: Potřebujete přidat funkce.
de: Solltest Du neue Funktionen brauchen.
hr: Trebaš dodatne funkcije.
uk: Вам потрібно додати функції.

source: You want to mitigate risks.
cs: Chcete zmírnit rizika.
de: Solltest du Risiken abschätzen wollen.
hr: Želi smanjiti rizike.
uk: Ви хочете зменшити ризики.

source: You need add-ons or integrations.
cs: Potřebujete doplňky nebo integrace.
de: Solltest Du Zusatzfunktionen oder Anpassungen brauchen.
hr: Trebaš dodatke ili integracije.
uk: Вам потрібні доповнення або інтеграції.

source: Support plans and maintenance contracts are available.
cs: Servisní plány a smlouvy o údržbě jsou k dispozici.
de: Unterstützungs- und Wartungsverträge sind erwünscht.
hr: Postoje planovi za podršku i ugovori o održavanju.
uk: Доступні плани підтримки та контракти на технічне обслуговування.
