Repository: pypi-data/pypi-mirror-338
Catalog: packages/open-web-calendar/open_web_calendar-1.49-py3-none-any.whl/open_web_calendar/translations/*/LC_MESSAGES/host/self.md.po
Languages: hr

source: There are various ways to host the Open Web Calendar yourself and customize the deployment.
hr: Postoji više načina za hosting aplikacije „Otvoreni web kalendar” i za prilagođavanje implementacije.

source: Self-Hosting & Deployment
hr: Vlastiti hosting i implementacija

source: You do not have to host the Open Web Calendar yourself but you are encouraged to. It is intended to work behind a company firewall, through a proxy and also without access to the Internet.
hr: Otvoreni web kalendar ne moraš postaviti na vlastitom serveru, no potičemo da to učiniš. Namijenjen je za rad iza vatrozida tvrtke, preko proxy servera i također bez pristupa internetu.

source: Several hosting options are already documented. We are grateful if you can add your favorite one, too.
hr: Nekoliko opcija hostinga su već dokumentirane. Ako možeš, dodaj svoju omiljenu.

source: You can create a fork of this repository which automatically deploys to [Vercel](https://vercel.com/):
hr: Možeš stvoriti vlastitu kopiju ovog repozitorija koja se automatski implementira na platformi [Vercel](https://vercel.com/):

source: Alternatively you can create a one off deploy by cloning this repository and running `npx vercel` at the root.
hr: Alternativno možeš izraditi jednokratnu implementaciju kloniranjem ovog repozitorija i pokretanjem `npx vercel`.

source: You can deploy the app using [Heroku](https://heroku.com).
hr: Aplikaciju možeš implementirati koristeći platformu [Heroku](https://heroku.com).

source: Heroku uses [gunicorn](https://gunicorn.org/) to run the server, see the [Procfile](https://github.com/niccokunzmann/open-web-calendar/blob/master/Procfile).
hr: Heroku koristi [gunicorn](https://gunicorn.org/) za pokretanje servera. Pogledaj [Procfile](https://github.com/niccokunzmann/open-web-calendar/blob/master/Procfile).

source: The Open Web Calendar has been integrated into [Cloudron](https://www.cloudron.io/).
hr: Otvoreni web kalendar je integriran u [Cloudron](https://www.cloudron.io/).

source: [Cloudron Documentation](https://docs.cloudron.io/apps/openwebcalendar/)
hr: [Cloudron dokumentacija](https://docs.cloudron.io/apps/openwebcalendar/)

source: [Cloudron Repository](https://git.cloudron.io/cloudron/openwebcalendar-app)
hr: [Cloudron repozitorij](https://git.cloudron.io/cloudron/openwebcalendar-app)

source: The Open Web Calendar is available as an app for [YunoHost](https://yunohost.org/).
hr: Otvoreni web kalendar je dostupan kao aplikacija za [YunoHost](https://yunohost.org/).

source: [App Description](https://apps.yunohost.org/app/open-web-calendar)
hr: [Opis aplikacije](https://apps.yunohost.org/app/open-web-calendar)

source: [Repository](https://github.com/YunoHost-Apps/open-web-calendar_ynh/blob/master/ALL_README.md)
hr: [Repozitorij](https://github.com/YunoHost-Apps/open-web-calendar_ynh/blob/master/ALL_README.md)

source: Update Notifications
hr: Obavijesti o novim verzijama

source: If you wish to receive notifications about new updates of the software, watch the [GitHub repository](https://github.com/niccokunzmann/open-web-calendar/).
hr: Ako želiš primati obavijesti o novim verzijama softvera, prati [GitHub repozitorij](https://github.com/niccokunzmann/open-web-calendar/).

source: **Choose a hoster.** These are listed below.
hr: **Odaberi pružatelja usluge za hosting.** Pogledaj popis.

source: [**Read about Configuration**](../configure).
hr: [**Pročitaj kako konfigurirati server**](../configure).

source: You can choose to run the Open Web Calendar installed as a Python package from PyPI. To do this, have a look at [the documentation](../pypi).
hr: Otvoreni web kalendar možeš pokretati instaliranjem kalendara kao Python paket iz PyPI. Pogledaj [dokumentaciju](../pypi).
